---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthAltOffset
source: html/e0c74624-240b-a999-01d3-a67bfb893646.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthAltOffset Property

"Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinSpanlengthAltOffset { get; }
```